import pandas as pd

ls = ["Հաճախորդ", "Հաճախորդի անուն/ազգանուն", "Ապահովադիր", "Ծննդյան ամսաթիվ",
          "ՀԾՀ", "Հաճախորդի անձնագրային տվյալներ", "Հեռախոսահամար", "Էլ. հասցե",
          "Գրանցման հասցե", "Բնակության հասցե", "Շահառու", "ՀՎՀՀ", "Ապահովագրվող գույքի տեսակ",
          "Գույքի ապահովագրական արժեք", "Ապահովագրական գումար", "Սակագին", "Ապահովագրվող գույքի հասցե",
          "Սեփականատեր անհատ", "Նոր պայմանագրի սկիզբ"]


ani_to_uni = {"²": "Ա",
                  "³": "ա",
                  "´": "Բ",
                  "µ": "բ",
                  "¶": "Գ",
                  "·": "գ",
                  "¸": "Դ",
                  "¹": "դ",
                  "º": "Ե",
                  "»": "ե",
                  '¼': 'Զ',
                  '½': 'զ',
                  '¾': 'Է',
                  '¿': 'է',
                  'À': 'Ը',
                  'Á': 'ը',
                  'Â': 'Թ',
                  'Ã': 'թ',
                  'Ä': 'Ժ',
                  'Å': 'ժ',
                  'Æ': 'Ի',
                  'Ç': 'ի',
                  'È': 'Լ',
                  'É': 'լ',
                  'Ê': 'Խ',
                  'Ë': 'խ',
                  'Ì': 'Ծ',
                  'Í': 'ծ',
                  'Î': 'Կ',
                  'Ï': 'կ',
                  'Ð': 'Հ',
                  'Ñ': 'հ',
                  'Ò': 'Ձ',
                  'Ó': 'ձ',
                  'Ô': 'Ղ',
                  'Õ': 'ղ',
                  'Ö': 'Ճ',
                  '×': 'ճ',
                  'Ø': 'Մ',
                  'Ù': 'մ',
                  'Ú': 'Յ',
                  'Û': 'յ',
                  'Ü': 'Ն',
                  'Ý': 'ն',
                  'Þ': 'Շ',
                  'ß': 'շ',
                  'à': 'Ո',
                  'á': 'ո',
                  'â': 'Չ',
                  'ã': 'չ',
                  'ä': 'Պ',
                  'å': 'պ',
                  'æ': 'Ջ',
                  'ç': 'ջ',
                  'è': 'Ռ',
                  'é': 'ռ',
                  'ê': 'Ս',
                  'ë': 'ս',
                  'ì': 'Վ',
                  'í': 'վ',
                  'î': 'Տ',
                  'ï': 'տ',
                  'ð': 'Ր',
                  'ñ': 'ր',
                  'ò': 'Ց',
                  'ó': 'ց',
                  'ô': 'Ւ',
                  'õ': 'ւ',
                  'ö': 'Փ',
                  '÷': 'փ',
                  'ø': 'Ք',
                  'ù': 'ք',
                  'ú': 'Օ',
                  'û': 'օ',
                  'ü': 'Ֆ',
                  'ý': 'ֆ',
                  '¨': 'և',
                  "'": "՚",
                  '°': '՛',
                  '¯': '՜',
                  'ª': '՝',
                  '±': '՞',
                  '£': '։',
                  '­': '֊',
                  '§': '«',
                  '¦': '»',
                  '«': ',',
                  '©': '.',
                  '®': '…'

                  }


df = pd.read_excel('accident.xlsx', header=None)
df.drop(df.index[:2], inplace=True)
len_row = df.columns[1::]

for i in len_row:
    try:
        df.replace({i: ani_to_uni}, regex=True, inplace=True)
    except:
        pass

for i in range(len(df)):
    data = df.values[i][1::]
    if len(str(data[2])) > 10:
        new = {"": data}
        exc_data = pd.DataFrame(new, index=ls)
        exc_data.to_excel('Excel_{}.xlsx'.format(i))


